In [8]:
import pandas as pd 
import mysql.connector
import sqlalchemy as alc
from sqlalchemy import create_engine

In [9]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'password',
    database = 'sakila')

In [10]:
engine = create_engine('mysql+mysqlconnector://root:password@localhost/sakila')

1. Tampilkan rata-rata durasi film di tiap kategori film! Urutkan dari rata-rata durasi terlama.

In [4]:
# Implicit join
query = '''
SELECT C.name, AVG(length) AS Rata_rata_durasi
FROM film F, film_category FC, category C 
WHERE F.film_id = FC.film_id AND FC.category_id = C.category_id
GROUP BY C.name
ORDER BY Rata DESC;
'''
pd.read_sql(query, engine)

       Category  Rata_Durasi
0        Sports     128.2027
1         Games     127.8361
2       Foreign     121.6986
3         Drama     120.8387
4        Comedy     115.8276
5        Family     114.7826
6         Music     113.6471
7        Travel     113.3158
8        Horror     112.4821
9      Classics     111.6667
10       Action     111.6094
11          New     111.1270
12    Animation     111.0152
13     Children     109.8000
14  Documentary     108.7500
15       Sci-Fi     108.1967

2. Tampilkan kategori film yang memiliki rata-rata durasi di atas rata-rata kategori film lainnya.

In [6]:
# Explicit join

query = '''
SELECT category.name AS Category, AVG(length) AS Avg_Duration, (SELECT AVG(length) FROM film) AS Cat_Avg_Duration
FROM film
JOIN film_category
ON film.film_id = film_category.film_id
JOIN category
ON film_category.category_id = category.category_id
GROUP BY category.name
HAVING AVG(length) > Cat_Avg_Duration
ORDER BY Avg_Duration DESC;
'''
pd.read_sql(query, engine)

  Category  Avg_Duration  Cat_Avg_Duration
0   Sports      128.2027           115.272
1    Games      127.8361           115.272
2  Foreign      121.6986           115.272
3    Drama      120.8387           115.272
4   Comedy      115.8276           115.272

3. Berapa banyak customer yang dilayani oleh 2 staff di Sakila Database?

In [25]:
query = '''
SELECT CONCAT(staff.first_name, " ", staff.last_name) AS Staff, COUNT(payment.payment_id) AS Total_Customer
FROM staff
JOIN payment
ON staff.staff_id = payment.staff_id
GROUP BY staff.first_name;
'''
pd.read_sql(query, engine)

          Staff  Total_Customer
0  Mike Hillyer            8057
1  Jon Stephens            7992

In [ ]:
# Mengatasi ERROR 1055, gunakan ANY_VALUE di SELECT clause untuk nama kolom yang digunakan di GROUP BY clause.
query = '''
SELECT ANY_VALUE(CONCAT(staff.first_name, " ", staff.last_name)) AS Staff, COUNT(payment.payment_id) AS Total_Customer
FROM staff
JOIN payment
ON staff.staff_id = payment.staff_id
GROUP BY staff.first_name;
'''
pd.read_sql(query, engine)